RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_xrdc2.c
/*
 * Copyright 2019-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_xrdc2.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.xrdc2"
#endif

/* Definitions for access policy. */
#define XRDC2_DXACP_WIDTH (3U)
#define XRDC2_DXACP_MASK  ((1UL << XRDC2_DXACP_WIDTH) - 1U)

#define XRDC2_DXACP_0_7(domainId, dxacp)  ((uint32_t)(dxacp) << (XRDC2_DXACP_WIDTH * (uint32_t)(domainId)))
#define XRDC2_DXACP_8_15(domainId, dxacp) ((uint32_t)(dxacp) << (XRDC2_DXACP_WIDTH * ((uint32_t)(domainId)-8U)))

#define XRDC2_DXACP_0_7_MASK(domainId)  XRDC2_DXACP_0_7(domainId, XRDC2_DXACP_MASK)
#define XRDC2_DXACP_8_15_MASK(domainId) XRDC2_DXACP_8_15(domainId, XRDC2_DXACP_MASK)

/* Memory region alignment. */
#define XRDC2_MRGD_ADDR_ALIGN_MASK (0x00000FFFU)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void XRDC2_MakeDXACP(const xrdc2_access_policy_t policy[FSL_FEATURE_XRDC2_DOMAIN_COUNT],
                            uint32_t *w0,
                            uint32_t *w1);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

static void XRDC2_MakeDXACP(const xrdc2_access_policy_t policy[FSL_FEATURE_XRDC2_DOMAIN_COUNT],
                            uint32_t *w0,
                            uint32_t *w1)
{
    uint32_t domain = (uint32_t)FSL_FEATURE_XRDC2_DOMAIN_COUNT;

    *w0 = 0U;
    *w1 = 0U;

#if (FSL_FEATURE_XRDC2_DOMAIN_COUNT > 8)
    while (domain > 8U)
    {
        domain--;
        *w0 <<= XRDC2_DXACP_WIDTH;
        *w0 |= (uint32_t)policy[domain - 8U];
    }
#endif

    while (domain > 0U)
    {
        domain--;
        *w1 <<= XRDC2_DXACP_WIDTH;
        *w1 |= (uint32_t)policy[domain];
    }
}

/*!
 * brief Initializes the XRDC2 module.
 *
 * This function enables the XRDC2 clock.
 *
 * param base XRDC2 peripheral base address.
 */
void XRDC2_Init(XRDC2_Type *base)
{
}

/*!
 * brief De-initializes the XRDC2 module.
 *
 * This function disables the XRDC2 clock.
 *
 * param base XRDC2 peripheral base address.
 */
void XRDC2_Deinit(XRDC2_Type *base)
{
}

/*!
 * brief Sets the XRDC2 global valid.
 *
 * This function sets the XRDC2 global valid or invalid. When the XRDC2 is global
 * invalid, all accesses from all bus masters to all slaves are allowed.
 *
 * param base XRDC2 peripheral base address.
 * param valid True to valid XRDC2.
 */
void XRDC2_SetGlobalValid(XRDC2_Type *base, bool valid)
{
    uint32_t mcr = base->MCR & ~(XRDC2_MCR_GVLDM_MASK | XRDC2_MCR_GVLDC_MASK);

    if (valid)
    {
        mcr |= XRDC2_MCR_GVLDM_MASK;
        base->MCR = mcr;

        /* Two dummy read to ensure the configuration takes effect. */
        (void)base->MCR;
        (void)base->MCR;

        mcr |= XRDC2_MCR_GVLDC_MASK;
        base->MCR = mcr;
    }
    else
    {
        base->MCR = mcr;
    }
}

/*!
 * brief Gets the default master domain assignment.
 *
 * This function sets the assignment as follows:
 *
 * code
 *  config->lock = false;
 *  config->privilegeAttr = kXRDC2_MasterPrivilege;
 *  config->secureAttr = kXRDC2_MasterSecure;
 *  config->domainId = 0U;
 *  config->mask = 0U;
 *  config->match = 0U;
 * endcode
 *
 * param assignment Pointer to the assignment structure.
 */
void XRDC2_GetDefaultMasterDomainAssignment(xrdc2_master_domain_assignment_t *assignment)
{
    assert(NULL != assignment);

    assignment->lock          = false;
    assignment->privilegeAttr = kXRDC2_MasterPrivilege;
    assignment->secureAttr    = kXRDC2_MasterSecure;
    assignment->domainId      = 0U;
    assignment->mask          = 0U;
    assignment->match         = 0U;
}

/*!
 * brief Sets the processor bus master domain assignment.
 *
 * param base XRDC2 peripheral base address.
 * param master Which master to configure.
 * param assignIndex Which assignment register to set.
 * param assignment Pointer to the assignment structure.
 */
void XRDC2_SetMasterDomainAssignment(XRDC2_Type *base,
                                     xrdc2_master_t master,
                                     uint8_t assignIndex,
                                     const xrdc2_master_domain_assignment_t *assignment)
{
    assert(NULL != assignment);
    uint32_t w0;
    uint32_t w1;

    w0 = (((uint32_t)assignment->mask << XRDC2_MDAC_MDA_W0_MASK_SHIFT) |
          ((uint32_t)assignment->match << XRDC2_MDAC_MDA_W0_MATCH_SHIFT));

    w1 = ((uint32_t)assignment->domainId << XRDC2_MDAC_MDA_W1_DID_SHIFT) |
         (XRDC2_MDAC_MDA_W1_PA(assignment->privilegeAttr)) | (XRDC2_MDAC_MDA_W1_SA(assignment->secureAttr)) |
         XRDC2_MDAC_MDA_W1_VLD_MASK;

    if (assignment->lock)
    {
        w1 |= XRDC2_MDAC_MDA_W1_DL_MASK;
    }

    base->MDACI_MDAJ[master][assignIndex].MDAC_MDA_W0 = w0;
    base->MDACI_MDAJ[master][assignIndex].MDAC_MDA_W1 = w1;
}

/*!
 * brief Gets the default memory slot access configuration.
 *
 * This function sets the assignment as follows:
 *
 * code
 *  config->lockMode = kXRDC2_AccessConfigLockDisabled;
 *  config->policy[0] = kXRDC2_AccessPolicyNone;
 *  config->policy[1] = kXRDC2_AccessPolicyNone;
 *  ...
 * endcode
 *
 * param config Pointer to the configuration.
 */
void XRDC2_GetMemSlotAccessDefaultConfig(xrdc2_mem_slot_access_config_t *config)
{
    assert(NULL != config);

    uint8_t domain;

    config->lockMode = kXRDC2_AccessConfigLockDisabled;

